{
  "terms-and-conditions": {
    "id": "terms-and-conditions",
    "title": "Terms and Conditions",
    "lastUpdated": "September 14, 2025",
    "content": "# Terms and Conditions\n\nLast updated: September 14, 2025\n\nPlease read these terms and conditions carefully before using Our Service.\n\n## Interpretation and Definitions\n\n### Interpretation\nThe words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.\n\n### Definitions\nFor the purposes of these Terms and Conditions:\n\n- **Application** means the software program provided by the Company downloaded by You on any electronic device, named Vesper\n- **Application Store** means the digital distribution service operated and developed by Apple Inc. (Apple App Store) or Google Inc. (Google Play Store) in which the Application has been downloaded.\n- **Affiliate** means an entity that controls, is controlled by or is under common control with a party, where \"control\" means ownership of 50% or more of the shares, equity interest or other securities entitled to vote for election of directors or other managing authority.\n- **Country** refers to: Albania\n- **Company** (referred to as either \"the Company\", \"We\", \"Us\" or \"Our\" in this Agreement) refers to Vesper, operated as an individual proprietorship.\n- **Device** means any device that can access the Service such as a computer, a cellphone or a digital tablet.\n- **Service** refers to the Application and related web services.\n- **Terms and Conditions** (also referred as \"Terms\") mean these Terms and Conditions that form the entire agreement between You and the Company regarding the use of the Service.\n- **Third-party Social Media Service** means any services or content (including data, information, products or services) provided by a third-party that may be displayed, included or made available by the Service.\n- **You** means the individual accessing or using the Service, or the company, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable.\n\n## Acknowledgment\n\nThese are the Terms and Conditions governing the use of this Service and the agreement that operates between You and the Company. These Terms and Conditions set out the rights and obligations of all users regarding the use of the Service.\n\nYour access to and use of the Service is conditioned on Your acceptance of and compliance with these Terms and Conditions. These Terms and Conditions apply to all visitors, users and others who access or use the Service.\n\nBy accessing or using the Service You agree to be bound by these Terms and Conditions. If You disagree with any part of these Terms and Conditions then You may not access the Service.\n\nYou represent that you are over the age of 18. The Company does not permit those under 18 to use the Service.\n\nYour access to and use of the Service is also conditioned on Your acceptance of and compliance with the Privacy Policy of the Company. Our Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your personal information when You use the Application or the Website and tells You about Your privacy rights and how the law protects You. Please read Our Privacy Policy carefully before using Our Service.\n\n## User Accounts\n\nWhen You create an account with us, You must provide information that is accurate, complete, and current at all times. You are responsible for safeguarding the password that You use to access the Service and for maintaining the confidentiality of Your account.\n\nYou agree not to disclose Your password to any third party. You must notify Us immediately upon becoming aware of any breach of security or unauthorized use of Your account.\n\nYou may not use as a username the name of another person or entity or that is not lawfully available for use, a name or trademark that is subject to any rights of another person or entity other than You without appropriate authorization, or a name that is otherwise offensive, vulgar or obscene.\n\n## Subscriptions and Payments\n\nSome parts of the Service are billed on a subscription basis (\"Subscription(s)\"). You will be billed in advance on a recurring monthly basis (\"Billing Cycle\").\n\nBilling cycles are set on a monthly basis. At the end of each Billing Cycle, Your Subscription will automatically renew under the exact same conditions unless You cancel it or the Company cancels it.\n\nA valid payment method, including credit card or PayPal, is required to process the payment for Your Subscription. You shall provide the Company with accurate and complete billing information including full name, address, state, zip code, telephone number, and valid payment method information.\n\nAll subscription payments are processed through PayPal's secure payment system. By subscribing, You agree to PayPal's terms of service and privacy policy. We do not store or have access to Your credit card or payment information - all payment data is handled exclusively by PayPal.\n\nSubscription fees are charged in USD ($2.99 per month). Your PayPal account will be automatically charged each billing cycle unless You cancel Your subscription before the next billing date.\n\nShould automatic billing fail to occur for any reason, the Company will issue an electronic invoice indicating that You must proceed manually, within a certain deadline date, with the full payment corresponding to the billing period as indicated on the invoice.\n\nThe Company reserves the right to change subscription fees at any time. Any price changes will apply to subsequent billing cycles and You will be notified at least 30 days in advance of any price changes.\n\n## Free Trial and Freemium Features\n\nWe may offer a free trial or limited free version of our Service. Free users may have restrictions on:\n- Number of AI interpretations per month (limited to 5)\n- Access to premium features\n- Historical dream data storage\n\nFree trial periods, if offered, will automatically convert to paid subscriptions unless You cancel before the trial expires. You will be notified of any charges before they occur.\n\nWe reserve the right to modify or discontinue free features at any time with reasonable notice.\n\n## Refunds and Cancellations\n\nExcept when required by law, purchased Subscriptions are non-refundable. Reason being that unlike tangible goods, the moment you purchase a Subscription, we have already made the digital content and features available to You.\n\nPayPal's refund policies may apply in certain circumstances. If You believe You are entitled to a refund under PayPal's Buyer Protection or other policies, You may file a dispute directly through PayPal. We will cooperate with PayPal's dispute resolution process.\n\nRefunds, if approved by PayPal or required by law, will be processed through the original payment method via PayPal within 5-10 business days.\n\nYou may cancel Your Subscription renewal either through Your Account settings page or by contacting customer service at support@vesperapp.com. You may also cancel directly through Your PayPal account by managing Your automatic payments/subscriptions.\n\nYour Subscription will remain active until the end of Your current billing period but it will not be renewed for additional periods. When You cancel through PayPal, You will receive confirmation from PayPal that automatic payments have been stopped.\n\nIf You cancel Your Subscription before the end of Your current paid up month, You will lose access to premium features immediately but retain access to Your saved dreams and basic features.\n\n## Prohibited Uses\n\nYou may not use our Service:\n- For any unlawful purpose or to solicit others to perform unlawful acts\n- To violate any international, federal, provincial or state regulations, rules, laws, or local ordinances\n- To infringe upon or violate our intellectual property rights or the intellectual property rights of others\n- To harass, abuse, insult, harm, defame, slander, disparage, intimidate, or discriminate\n- To submit false or misleading information\n- To upload or transmit viruses or any other type of malicious code\n- To collect or track the personal information of others\n- To spam, phish, pharm, pretext, spider, crawl, or scrape\n- For any obscene or immoral purpose or to engage in any other activity which is prohibited by law\n- To interfere with or circumvent the security features of the Service or any related services\n- To reverse engineer, decompile or disassemble any portion of the Service\n\n## Intellectual Property Rights\n\nThe Service and its original content, features and functionality are and will remain the exclusive property of the Company and its licensors. The Service is protected by copyright, trademark, and other laws. Our trademarks and trade dress may not be used in connection with any product or service without our prior written consent.\n\nYou retain ownership of any dream content You submit to the Service. However, by submitting content, You grant us a limited license to use, store, and process Your content solely for the purpose of providing the Service, including generating AI interpretations.\n\n## Content and AI Interpretations\n\nOur dream interpretation feature uses artificial intelligence technology. While We strive for accuracy and usefulness, AI interpretations are for entertainment and self-reflection purposes only and should not be considered as professional psychological, medical, or therapeutic advice.\n\nDream interpretations are generated based on general patterns and should not be relied upon for making important life decisions. If You are experiencing persistent disturbing dreams or mental health concerns, We recommend consulting with a qualified healthcare professional.\n\nYou acknowledge that AI interpretations may not always be accurate, appropriate, or suitable for Your specific situation. You use these interpretations at Your own discretion and risk.\n\n## User-Generated Content\n\nYou are responsible for any content You submit to the Service, including dream descriptions and personal reflections. You warrant that:\n- You own or have the necessary rights to use and authorize us to use all content You submit\n- Your content does not infringe any third party's rights\n- Your content complies with these Terms and applicable laws\n\nWe reserve the right to remove any content that violates these Terms or that we deem inappropriate, though we are not obligated to monitor or review content.\n\n## Service Availability and Limitations\n\nWe strive to provide reliable service availability, but We make no guarantees about uptime or uninterrupted access. Scheduled maintenance, technical issues, or third-party service disruptions may cause temporary interruptions to the Service.\n\nWe reserve the right to limit the number of AI interpretations available to free users and may implement usage restrictions to ensure fair access for all users.\n\nThe Service depends on third-party AI services and may be affected by changes in those services beyond our control.\n\n## Data and Privacy\n\nYour privacy is important to us. Please review our Privacy Policy, which also governs Your use of the Service, to understand our practices.\n\nWe use industry-standard security measures to protect Your data, but we cannot guarantee absolute security. You acknowledge that You provide Your personal information at Your own risk.\n\n## Age Restrictions\n\nYou must be at least 18 years of age to use this Service. If You are under 18, You may only use the Service with the involvement and consent of a parent or guardian.\n\n## Links to Other Websites\n\nOur Service may contain links to third-party web sites or services that are not owned or controlled by the Company.\n\nThe Company has no control over, and assumes no responsibility for, the content, privacy policies, or practices of any third party web sites or services. You further acknowledge and agree that the Company shall not be responsible or liable, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any such content, goods or services available on or through any such web sites or services.\n\nWe strongly advise You to read the terms and conditions and privacy policies of any third-party web sites or services that You visit.\n\n## Termination\n\nWe may terminate or suspend Your access immediately, without prior notice or liability, for any reason whatsoever, including without limitation if You breach these Terms and Conditions.\n\nUpon termination, Your right to use the Service will cease immediately. If You paid for a subscription, termination will be effective at the end of your current billing period.\n\nIf Your account is terminated for violation of these Terms, You will not be entitled to any refund of unused subscription fees.\n\n## Disclaimer of Warranties\n\nThe Service is provided to You \"AS IS\" and \"AS AVAILABLE\" and with all faults and defects without warranty of any kind. To the maximum extent permitted under applicable law, the Company, on its own behalf and on behalf of its Affiliates and its and their respective licensors and service providers, expressly disclaims all warranties, whether express, implied, statutory or otherwise, with respect to the Service, including all implied warranties of merchantability, fitness for a particular purpose, title and non-infringement, and warranties that may arise out of course of dealing, course of performance, usage or trade practice.\n\n## Limitation of Liability\n\nNotwithstanding any damages that You might incur, the entire liability of the Company and any of its suppliers under any provision of this Terms and Your exclusive remedy for all of the foregoing shall be limited to the amount actually paid by You through the Service or 100 USD if You haven't purchased anything through the Service.\n\nTo the maximum extent permitted by applicable law, in no event shall the Company or its suppliers be liable for any special, incidental, indirect, or consequential damages whatsoever (including, but not limited to, damages for loss of profits, loss of data or other information, for business interruption, for personal injury, loss of privacy arising out of or in any way related to the use of or inability to use the Service, third-party software and/or third-party hardware used with the Service, or otherwise in connection with any provision of this Terms), even if the Company or any supplier has been advised of the possibility of such damages and even if the remedy fails of its essential purpose.\n\n## Governing Law\n\nThe laws of Albania, excluding its conflicts of law rules, shall govern this Terms and Your use of the Service. Your use of the Application may also be subject to other local, state, national, or international laws.\n\n## Disputes Resolution\n\nIf You have any concern or dispute about the Service, You agree to first try to resolve the dispute informally by contacting the Company at support@vesperapp.com.\n\n## For European Union (EU) Users\n\nIf You are a European Union consumer, you will benefit from any mandatory provisions of the law of the country in which You are resident.\n\n## Severability and Waiver\n\n### Severability\nIf any provision of these Terms is held to be unenforceable or invalid, such provision will be changed and interpreted to accomplish the objectives of such provision to the greatest extent possible under applicable law and the remaining provisions will continue in full force and effect.\n\n### Waiver\nExcept as provided herein, the failure to exercise a right or to require performance of an obligation under these Terms shall not affect a party's ability to exercise such right or require such performance at any time thereafter nor shall the waiver of a breach constitute a waiver of any subsequent breach.\n\n## Translation Interpretation\n\nThese Terms and Conditions may have been translated if We have made them available to You on our Service. You agree that the original English text shall prevail in the case of a dispute.\n\n## Changes to These Terms and Conditions\n\nWe reserve the right, at Our sole discretion, to modify or replace these Terms at any time. If a revision is material We will make reasonable efforts to provide at least 30 days' notice prior to any new terms taking effect. What constitutes a material change will be determined at Our sole discretion.\n\nBy continuing to access or use Our Service after those revisions become effective, You agree to be bound by the revised terms. If You do not agree to the new terms, in whole or in part, please stop using the website and the Service.\n\n## Contact Us\n\nIf you have any questions about these Terms and Conditions, You can contact us:\n- By email: support@vesperapp.com"
  },
  "privacy-policy": {
    "id": "privacy-policy",
    "title": "Privacy Policy",
    "lastUpdated": "September 14, 2025",
    "content": "# Privacy Policy\n\nLast updated: September 14, 2025\n\nThis Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your information when You use the Vesper dream interpretation service and tells You about Your privacy rights and how the law protects You.\n\nWe use Your Personal data to provide and improve the Service. By using the Service, You agree to the collection and use of information in accordance with this Privacy Policy.\n\n**Important:** This app processes your personal dream content using artificial intelligence. Please read this policy carefully to understand how we handle your sensitive information.\n\n## Interpretation and Definitions\n\n### Interpretation\nThe words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.\n\n### Definitions\nFor the purposes of this Privacy Policy:\n\n- **Account** means a unique account created for You to access our Service or parts of our Service.\n- **Application** refers to Vesper, the dream interpretation software program provided by the Company.\n- **Company** (referred to as either \"the Company\", \"We\", \"Us\" or \"Our\" in this Agreement) refers to Vesper, operated as an individual proprietorship.\n- **Country** refers to: Albania\n- **Device** means any device that can access the Service such as a computer, a cellphone or a digital tablet.\n- **Dream Content** means any dreams, dream descriptions, emotions, tags, or related personal content You submit to the Service.\n- **Personal Data** is any information that relates to an identified or identifiable individual.\n- **Service** refers to the Application and related dream interpretation services.\n- **Service Provider** means any natural or legal person who processes the data on behalf of the Company, including AI service providers, cloud storage providers, and payment processors.\n- **Usage Data** refers to data collected automatically, either generated by the use of the Service or from the Service infrastructure itself.\n- **You** means the individual accessing or using the Service.\n\n## Information We Collect\n\n### Personal Data\nWhile using Our Service, We collect the following personally identifiable information:\n\n- **Account Information:** Name, email address, and account preferences\n- **Dream Content:** Dream descriptions, emotions/moods, tags, and related personal reflections You provide\n- **Payment Information:** Processed securely through PayPal (we do not store credit card details)\n- **Communication:** Messages You send to our support team\n\n### Usage Data\nWe automatically collect information about how You use our Service:\n\n- Device information (type, operating system, unique identifiers)\n- App usage patterns (features used, time spent, frequency of use)\n- Technical data (IP address, crash logs, error reports)\n- Analytics data (aggregated usage statistics)\n\n## How We Use Your Information\n\n### Dream Content Processing\nWe use Your dream content specifically to:\n\n- **Generate AI Interpretations:** Your dreams are processed by artificial intelligence to provide personalized interpretations\n- **Improve AI Accuracy:** Dream content may be used anonymously to train and improve our interpretation algorithms\n- **Provide Dream History:** Store your dreams and interpretations for your personal reference\n- **Usage Analytics:** Understand which interpretation themes are most helpful (in aggregate only)\n\n### Other Uses\nWe also use Your information to:\n\n- Create and manage Your account\n- Process subscription payments through PayPal\n- Send important service notifications and updates\n- Provide customer support\n- Ensure security and prevent fraud\n- Comply with legal obligations\n- Improve our Service based on usage patterns\n\n## How We Share Your Information\n\nWe are committed to protecting your privacy. We share Your information only in these limited circumstances:\n\n### Service Providers\nWe work with trusted third-party services:\n\n- **AI Processing:** Dream content is sent to Google Gemini Flash 1.5 to generate interpretations\n- **Cloud Storage:** Your data is securely stored on Heroku (United States) and Render (United States)\n- **Analytics:** Usage data (not dream content) is shared with analytics services to improve the app\n- **Payment Processing:** PayPal handles all payment processing and subscription management\n\n### Legal Requirements\nWe may disclose Your information if required by law, court order, or government request.\n\n### Business Transfers\nIn the event of a merger, acquisition, or sale, Your information may be transferred to the new entity.\n\n### What We Never Share\nWe will never:\n\n- Sell Your personal information or dream content to third parties\n- Share Your dreams publicly or with other users\n- Use Your dream content for marketing or advertising purposes\n- Share identifiable dream content with researchers without explicit consent\n\n## Data Security and Protection\n\nWe implement industry-standard security measures:\n\n- Encryption of data in transit and at rest\n- Secure authentication and access controls\n- Regular security audits and monitoring\n- Limited access to Your data on a need-to-know basis\n\nHowever, no method of transmission over the Internet is 100% secure. While we strive to protect Your data, we cannot guarantee absolute security.\n\n## Your Privacy Rights\n\nYou have the following rights regarding Your personal data:\n\n### Access and Portability\n- View all personal data we have about You\n- Download Your dream content and interpretations\n- Receive Your data in a machine-readable format\n\n### Correction and Updates\n- Edit Your account information at any time\n- Update or delete individual dream entries\n- Correct inaccurate personal information\n\n### Deletion\n- Delete Your account and all associated data\n- Request removal of specific dream entries\n- Withdraw consent for data processing\n\nTo exercise these rights, contact us at support@vesperapp.com or use the in-app settings.\n\n## Data Retention\n\nWe retain Your information for different periods:\n\n- **Dream Content:** Until You delete it or close Your account\n- **Account Information:** Until account deletion, plus 30 days for security purposes\n- **Usage Data:** Up to 24 months for analytics and service improvement\n- **Legal Data:** As required by applicable laws and regulations\n\n## International Data Transfers\n\nYour data may be processed in countries outside Albania, including:\n\n- United States (AI processing services)\n- European Union (cloud storage)\n- Other countries where our service providers operate\n\nWe ensure adequate protection through standard contractual clauses and other legal safeguards.\n\n## Children's Privacy\n\nOur Service is not intended for anyone under 18. We do not knowingly collect personal information from minors. If You are a parent and believe Your child has provided us with personal data, please contact us immediately.\n\nIf we discover we have collected personal data from a minor, we will delete it promptly.\n\n## Third-Party Services\n\nOur Service integrates with third-party services that have their own privacy policies:\n\n- **PayPal:** For payment processing\n- **Google Gemini Flash 1.5:** For dream interpretation processing\n- **Cloud Storage Providers:** For secure data storage\n- **Analytics Services:** For app improvement and crash reporting\n\nWe encourage You to review the privacy policies of these services.\n\n## GDPR Compliance (EU Users)\n\nIf You are located in the European Union, You have additional rights under GDPR:\n\n- Right to object to data processing\n- Right to restrict processing\n- Right to lodge complaints with supervisory authorities\n- Right to withdraw consent at any time\n\nOur legal basis for processing Your data includes:\n\n- Contract performance (providing dream interpretation services)\n- Legitimate interests (service improvement and security)\n- Legal compliance (when required by law)\n- Consent (for marketing communications, if opted in)\n\n## Changes to This Privacy Policy\n\nWe may update this Privacy Policy periodically. When we make material changes:\n\n- We will notify You via email and in-app notification\n- We will update the \"Last updated\" date\n- We will provide at least 30 days' notice for significant changes\n\nYour continued use of the Service after changes become effective constitutes acceptance of the updated policy.\n\n## Contact Us\n\nIf you have questions about this Privacy Policy or want to exercise Your privacy rights:\n\n- **Email:** support@vesperapp.com\n- **Subject Line:** \"Privacy Policy Inquiry\"\n- **Response Time:** We will respond within 30 days\n\nFor EU residents: If You are not satisfied with our response, You have the right to lodge a complaint with your local data protection authority."
  }
}